app/controllers/exercicios_controller.rb

  def index
    @exercicios = Exercicio.all
---
SELECT * FROM `exercicios`

  def show
    @exercicio = Exercicio.find(params[:id])
---
SELECT * FROM `exercicios` WHERE (`exercicios`.`id` = 1)

  def edit
    @exercicio = Exercicio.find(params[:id])
---
SELECT * FROM `exercicios` WHERE (`exercicios`.`id` = 1)

  def create
    @exercicio = Exercicio.new(params[:exercicio])

    respond_to do |format|
      if @exercicio.save
---
INSERT INTO `exercicios` (`created_at`, `tipo_de_exercicio_id`, `updated_at`, `inicio`, `frequencia_cardiaca`, `fim`) VALUES('2009-10-24 07:27:01', 1, '2009-10-24 07:27:01', '2009-10-24 08:15:00', 155, '2009-10-24 10:15:00')

  def update
    @exercicio = Exercicio.find(params[:id])

    respond_to do |format|
      if @exercicio.update_attributes(params[:exercicio])
---
SELECT * FROM `exercicios` WHERE (`exercicios`.`id` = 1)
UPDATE `exercicios` SET `updated_at` = '2009-10-24 07:30:02', `tipo_de_exercicio_id` = 3 WHERE `id` = 1