app/controllers/tipo_de_exercicios_controller.rb

  def index
    @tipo_de_exercicios = TipoDeExercicio.all
---
SELECT * FROM `tipo_de_exercicios`

  def show
    @tipo_de_exercicio = TipoDeExercicio.find(params[:id])
---
SELECT * FROM `tipo_de_exercicios` WHERE (`tipo_de_exercicios`.`id` = 1)

  def create
    @tipo_de_exercicio = TipoDeExercicio.new(params[:tipo_de_exercicio])

    respond_to do |format|
      if @tipo_de_exercicio.save
---
INSERT INTO `tipo_de_exercicios` (`created_at`, `nome`, `updated_at`) VALUES('2009-10-24 07:14:48', 'Corrida', '2009-10-24 07:14:48')